In [1]:
from __future__ import print_function, division
import pandas as pd
pd.set_option("display.max_rows", 20)
pd.set_option("display.max_columns", 500)
pd.set_option("display.width", 1000)
import time

## pandas.groupby学习

### groupby示意
groupby就是按某个字段分组, 它也确实是用来实现这样功能的.   
比如, 将一份数据集按A列进行分组：

### 读取数据

In [4]:
%%time
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv("./input/train_set.csv", nrows=1000)
df.head()

Wall time: 10 ms

   ID  age         job   marital  education default  balance housing loan   contact  day month  duration  campaign  pdays  previous poutcome  y
0   1   43  management   married   tertiary      no      291     yes   no   unknown    9   may       150         2     -1         0  unknown  0
1   2   42  technician  divorced    primary      no     5076     yes   no  cellular    7   apr        99         1    251         2    other  0
2   3   47      admin.   married  secondary      no      104     yes  yes  cellular   14   jul        77         2     -1         0  unknown  0
3   4   28  management    single  secondary      no     -994     yes  yes  cellular   18   jul       174         2     -1         0  unknown  0
4   5   42  technician  divorced  secondary      no     2974     yes   no   unknown   21   may       187         5     -1         0  unknown  0

In [5]:
print(set(df["job"]))

{'entrepreneur', 'admin.', 'unemployed', 'housemaid', 'technician', 'student', 'blue-collar', 'services', 'management', 'self-employed', 'unknown', 'retired'}

### groupby对象
DataFrame使用groupby()函数返回的结果是DataFrameGroupBy   
不是一个DataFrame或者Series

In [6]:
groupbyage = df.groupby("age")
print(type(groupbyage))
print(groupbyage)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000212F6E05208>

groupby分组不仅可以指定一个列名，也可以指定多个列名

In [7]:
groupbyagemarital = df.groupby(["age", "marital"])
print(groupbyagemarital.size())
print(groupbyagemarital)

age  marital
20   single      1
21   married     1
     single      1
22   single      1
23   married     1
                ..
79   divorced    1
80   divorced    1
81   divorced    1
83   divorced    1
     married     1
Length: 123, dtype: int64
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000212F7436E48>

### 可以通过调用get_group()获得按照分组得到的DataFrame对象

In [9]:
# groupbyagedf = groupbyage.get_group('age').reset_index()
# print(groupbyagedf)

### groupby常用的一些功能

In [17]:
df.groupby("job")["age"].sum().reset_index().rename(columns={"age":"age_sum"})

              job  age_sum
0          admin.     4908
1     blue-collar     9141
2    entrepreneur     1115
3       housemaid      871
4      management     8258
5         retired     2997
6   self-employed     1431
7        services     4397
8         student      602
9      technician     5859
10     unemployed     1317
11        unknown      450

In [18]:
df.groupby("job")["age"].mean().reset_index().rename(columns={"age":"age_mean"})

              job   age_mean
0          admin.  39.580645
1     blue-collar  40.268722
2    entrepreneur  41.296296
3       housemaid  45.842105
4      management  40.480392
5         retired  61.163265
6   self-employed  42.088235
7        services  40.712963
8         student  27.363636
9      technician  40.406897
10     unemployed  41.156250
11        unknown  50.000000

In [19]:
df.groupby('job')['age'].count()

job
admin.           124
blue-collar      227
entrepreneur      27
housemaid         19
management       204
retired           49
self-employed     34
services         108
student           22
technician       145
unemployed        32
unknown            9
Name: age, dtype: int64